/**
 * Copyright (c) 2015-2019 Shanghai Fullhan Microelectronics Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 *
 * Change Logs:
 * Date           Author       Notes
 * 2019-04-12     zhangy       the first version
 */

/*****************************************************************************
 *  Include Section
 *  add all #include here
 *****************************************************************************/

#include <rthw.h>
#include "fh_aes.h"
#include "board_info.h"
#include "fh_def.h"
#include <rtthread.h>
// #include "interrupt.h"
#include "fh_clock.h"
/* #include "pipe_mem.h" */
#ifdef CPU_ARC
#include "arc6xx.h"
#endif
/*****************************************************************************
 * Define section
 * add all #define here
 *****************************************************************************/
/* #define AES_DEBUG */
#ifdef AES_DEBUG
#define AES_DBG(fmt, args...)     \
    do                                  \
    {                                   \
        rt_kprintf("[AES]: ");   \
        rt_kprintf(fmt, ## args);       \
    }                                   \
    while (0)
#else
#define AES_DBG(fmt, args...)  do { } while (0)
#endif

#define AES_ERR(fmt, args...)     \
    do                                  \
    {                                   \
        rt_kprintf("[AES ERROR]: ");   \
        rt_kprintf(fmt, ## args);       \
    }                                   \
    while (0)

#define CRYPTO_QUEUE_LEN    (1)
#define CRYPTION_POS        (0)
#define METHOD_POS          (1)
#define EMODE_POS           (4)
#define EFUSE_TIMEOUT           100000

#define __raw_writeb(v, a)       (*(volatile unsigned char  *)(a) = (v))
#define __raw_writew(v, a)       (*(volatile unsigned short *)(a) = (v))
#define __raw_writel(v, a)       (*(volatile unsigned int   *)(a) = (v))

#define __raw_readb(a)          (*(volatile unsigned char  *)(a))
#define __raw_readw(a)          (*(volatile unsigned short *)(a))
#define __raw_readl(a)          (*(volatile unsigned int   *)(a))

#define aes_readl(aes, name) \
    __raw_readl(&(((struct fh_aes_reg *)aes->regs)->name))

#define aes_writel(aes, name, val) \
    __raw_writel((val), &(((struct fh_aes_reg *)aes->regs)->name))

#define aes_readw(aes, name) \
    __raw_readw(&(((struct fh_aes_reg *)aes->regs)->name))

#define aes_writew(aes, name, val) \
    __raw_writew((val), &(((struct fh_aes_reg *)aes->regs)->name))

#define aes_readb(aes, name) \
    __raw_readb(&(((struct fh_aes_reg *)aes->regs)->name))

#define aes_writeb(aes, name, val) \
    __raw_writeb((val), &(((struct fh_aes_reg *)aes->regs)->name))

#define wrap_readl(wrap, name) \
    __raw_readl(&(((struct wrap_efuse_reg *)wrap->regs)->name))

#define wrap_writel(wrap, name, val) \
    __raw_writel((val), &(((struct wrap_efuse_reg *)wrap->regs)->name))

#define wrap_readw(wrap, name) \
    __raw_readw(&(((struct wrap_efuse_reg *)wrap->regs)->name))

#define wrap_writew(wrap, name, val) \
    __raw_writew((val), &(((struct wrap_efuse_reg *)wrap->regs)->name))

#define wrap_readb(wrap, name) \
    __raw_readb(&(((struct wrap_efuse_reg *)wrap->regs)->name))

#define wrap_writeb(wrap, name, val) \
    __raw_writeb((val), &(((struct wrap_efuse_reg *)wrap->regs)->name))

#define ASSERT(expr) if (!(expr)) { \
        rt_kprintf("Assertion failed! %s:line %d\n", \
        __func__, __LINE__); \
        while (1)   \
           ;       \
        }

#define DMA_MAX_PROCESS_SIZE            2048

struct wrap_efuse_reg
{
    rt_uint32_t efuse_cmd;              /* 0x0 */
    rt_uint32_t efuse_config;           /* 0x4 */
    rt_uint32_t efuse_match_key;        /* 0x8 */
    rt_uint32_t efuse_timing0;          /* 0xc */
    rt_uint32_t efuse_timing1;          /* 0x10 */
    rt_uint32_t efuse_timing2;          /* 0x14 */
    rt_uint32_t efuse_timing3;          /* 0x18 */
    rt_uint32_t efuse_timing4;          /* 0x1c */
    rt_uint32_t efuse_timing5;          /* 0x20 */
    rt_uint32_t efuse_timing6;          /* 0x24 */
    rt_uint32_t efuse_dout;             /* 0x28 */
    rt_uint32_t efuse_status0;          /* 0x2c */
    rt_uint32_t efuse_status1;          /* 0x30 */
    rt_uint32_t efuse_status2;          /* 0x34 */
    rt_uint32_t efuse_status3;          /* 0x38 */
    rt_uint32_t efuse_status4;          /* 0x3c */
    rt_uint32_t efuse_mem_info;
};

struct wrap_efuse_obj s_efuse_obj = { 0 };
#define EFUSE_MAX_ENTRY         60
#define EFUSE_DEBUG_ENTRY_NO_MIN			60
#define EFUSE_DEBUG_ENTRY_NO_MAX			62

#if defined CONFIG_ARCH_FH8626V100
#define MATCH_KEY    0x53d485a7
#else
#define MATCH_KEY    0x92fc0025
#endif

#define SECURE_BOOT_ENTRY    (48)
#define SECURE_BOOT_ACTIVE_VAL    (1<<0)
#define SOC_BOOT_MODE_WITH_SECURE    0xaa5555aa
#define SECURE_PROTECT_EFUSE_ENTRY_MAX_INDEX    16
/****************************************************************************
 * ADT section
 *  add definition of user defined Data Type that only be used in this file  here
 ***************************************************************************/
enum {
    CMD_TRANS_AESKEY = 4,
    CMD_WFLGA_AUTO = 8,
};

enum {
    ENCRYPT = 0 << CRYPTION_POS,
    DECRYPT = 1 << CRYPTION_POS,
};

enum {
    ECB_MODE = 0 << EMODE_POS,
    CBC_MODE = 1 << EMODE_POS,
