/**
 * Copyright (c) 2015-2019 Shanghai Fullhan Microelectronics Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 *
 * Change Logs:
 * Date           Author       Notes
 * 2024-2-28      zhangy       add first version driver
 */

#include "fh_dma.h"
#include "mmu.h"
#include "dma.h"
#include <stdint.h>
#include <rtdevice.h>
#include <rthw.h>
#include "fh_arch.h"
#include "mmu.h"
#include "fh_def.h"
#include "board_info.h"

#include "mol_dma.h"
#include "delay.h"
#ifdef RT_USING_PM
#include <pm.h>
#endif


#ifndef BIT
#define BIT(x) (1 << (x))
#endif


#if defined(MC_DMA_DEBUG) && defined(RT_DEBUG)
#define FH_MC_DMA_PRINT(fmt, args...) rt_kprintf(fmt, ##args);
#else
#define FH_MC_DMA_PRINT(fmt, args...)
#endif

#define MC_DMA_ASSERT(expr) if (!(expr)) { \
        rt_kprintf("Assertion failed! %s:line %d\n", \
        __func__, __LINE__); \
        while (1)   \
           ;       \
        }

#define MC_DMA_NULL			(0)
#define MC_DESC_ALLIGN                64  /*DO NOT TOUCH!!!*/
#define MC_DESC_ALLIGN_BIT_MASK     0x3f  /*DO NOT TOUCH!!!*/
#define lift_shift_bit_num(bit_num) (1 << bit_num)
#define MC_DMA_MAX_NR_CHANNELS 32
#define MC_DMA_MAX_HAND_SHAKE_NO 64



#ifndef GENMASK
#define GENMASK(h, l) (((~0UL) << (l)) & (~0UL >> (sizeof(long) * 8 - 1 - (h))))
#endif
#ifndef GENMASK_ULL
#define GENMASK_ULL(h, l)                                                      \
	(((~0ULL) << (l)) & (~0ULL >> (sizeof(long long) * 8 - 1 - (h))))
#endif



#define AUDIO_CNT_CLK_EN		BIT(21)

#define BLK_LEN_DUMMY					10
#define TRSC_LEN_DUMMY					10
#define FRAG_LEN_DUMMY					10

//channel def
#define CHAN_PAUSE	1
#define CHAN_ACTIVE	0
#define CHAN_PAUSE_BIT_MASK	1
#define LLIST_EN					(1<<4)

#define CH_ENABLE					1

#define CH_FRAGMENT_INT_EN				(0x1<<0)
#define CH_BLK_INT_EN					(0x1<<1)
#define CH_TRSC_INT_EN					(0x1<<2)
#define CH_LLIST_INT_EN					(0x1<<3)
#define CH_CFG_ERR_INT_EN				(0x1<<4)
#define CH_AUTO_CLOSE_EN			(0x1<<5)

#define CH_RAW_ISR_STATUS_MASK		(0x1f << 8)


#define CH_ALLINTRC_EN_MASK				CH_FRAGMENT_INT_EN|\
							CH_BLK_INT_EN|\
							CH_TRSC_INT_EN|\
							CH_LLIST_INT_EN|\
							CH_CFG_ERR_INT_EN
							

//desc def
#define BLK_LEN_MASK					0x1ffff
#define FRAG_LEN_MASK					0x1ffff
#define TRSC_LEN_MASK					0xfffffff

#define REQ_MODE_SHIFT					24
#define REQ_MODE_MASK					0x3

#define SRC_DST_AHB_SIZE_MASK			0xf
#define DST_AHB_SIZE_SHIFT				28
#define SRC_AHB_SIZE_SHIFT				30
#define ADDR_FIX_EN_SHIFT				20
#define ADDR_FIX_SEL_SHIFT				21
#define ADDR_WRAP_EN_SHIFT				22

#define WORD_STEP					0x4
#define DST_TRSF_STEP_SHIFT				16
#define TRSF_STEP_MASK					0xffffffff
#define LLIST_END						1
#define NOT_LLIST_END					0
#define LLIST_END_SHIFT					19

#define SWT_MODE_SHIFT              26
#define SWT_MODE_MASK               3

#define CHN_TRSC_LEN_LLIST_NODE_INT_EN			(0x1<<31)
#define CHN_TRSC_LEN_LLIST_NODE_INT_FRAG		(0x1<<28)
#define CHN_TRSC_LEN_LLIST_NODE_INT_BLK			(0x1<<29)
#define CHN_TRSC_LEN_LLIST_NODE_INT_TRSC		(0x1<<30)


#define ISR_LINK_DONE_RAW_STAT_BIT		(0x1<<11)
#define ISR_TRSC_DONE_RAW_STAT_BIT		(0x1<<10)
#define ISR_BLK_DONE_RAW_STAT_BIT		(0x1<<9)
#define ISR_FRAG_DONE_RAW_STAT_BIT		(0x1<<8)
#define VERSION_FH_MASK	(0xffff0000)
#define VERSION_NUM_MASK	(0x0000ffff)
#define VERSION_FH	(0x46480000)
#define mc_dma_list_entry(node, type, member) \
    ((type *)((char *)(node) - (unsigned long)(&((type *)0)->member)))

#define mc_dma_list_for_each_entry_safe(pos, n, head, member)                \
    for (pos = mc_dma_list_entry((head)->next, typeof(*pos), member),     \
        n    = mc_dma_list_entry(pos->member.next, typeof(*pos), member); \
         &pos->member != (head);                                      \
         pos = n, n = mc_dma_list_entry(n->member.next, typeof(*n), member))


#define DMA_COMMON_ISR_OPEN     1
#define DMA_COMMON_ISR_CLOSE    0

#define USR_DEF_MODE	0x55aaaa55
#define DMA_MEMCPY_FIX_LEN    0x80
extern void mmu_clean_invalidated_dcache(rt_uint32_t buffer, rt_uint32_t size);
#define mc_dma_invalidate_desc    mmu_clean_invalidated_dcache
#define mc_dma_clean_desc    mmu_clean_invalidated_dcache

#define PM_DMA_CHAN_WAIT_MAX_TIME    0xffff
/****************************************************************************
 * ADT section
 *  add definition of user defined Data Type that only be used in this file  here
 ***************************************************************************/
enum {
	MC_DMA_RET_OK    = 0,
	MC_DMA_RET_NO_MEM   = 1,
};

struct  mc_dma_lli {

	rt_uint32_t src_addr;
	rt_uint32_t dst_addr;
	rt_uint32_t frag_len;
	rt_uint32_t blk_len;
	rt_uint32_t trans_len;
	rt_uint32_t trsf_step;
	rt_uint32_t wrap_ptr;
	rt_uint32_t wrap_to;
	rt_uint32_t llist_ptr;
	rt_uint32_t frag_step;
	rt_uint32_t src_blk_step;
	rt_uint32_t dst_blk_step;
};

/* Hardware register definitions. */
struct dw_mc_dma_chan_regs {
	rt_uint32_t pause;//0
	rt_uint32_t req;
	rt_uint32_t cfg;
	rt_uint32_t interrupt;
	rt_uint32_t src_addr;//10
	rt_uint32_t dst_addr;
	rt_uint32_t frag_len;
	rt_uint32_t blk_len;
	rt_uint32_t trsc_len;//20
	rt_uint32_t trsf_step;
	rt_uint32_t wrap_ptr;
	rt_uint32_t wrap_to;
	rt_uint32_t llist_ptr;//30
	rt_uint32_t frag_step;
	rt_uint32_t src_blk_step;
	rt_uint32_t dst_blk_step;
};

struct dw_mc_dma_regs {
	rt_uint32_t pause;//0
	rt_uint32_t frag_wait;
	rt_uint32_t pend_0_en;
	rt_uint32_t pend_1_en;
	rt_uint32_t int_raw_stat;//10
	rt_uint32_t int_mask_stat;
	rt_uint32_t req_stat;
	rt_uint32_t en_stat;
	rt_uint32_t debug_stat;//20
	rt_uint32_t arb_sel_stat;
	rt_uint32_t ch_cfg_grp_1;
	rt_uint32_t ch_cfg_grp_2;
	rt_uint32_t ch_arprot;//30
	rt_uint32_t ch_awprot;
	rt_uint32_t ch_prot_flag;
	rt_uint32_t global_prot;
	rt_uint32_t pend_0_port;//40
	rt_uint32_t pend_1_port;
	rt_uint32_t reqid_0_port;
	rt_uint32_t reqid_1_port;
	rt_uint32_t sync_sec_n_normal;//50
	rt_uint32_t cnt_ch_sel;
	rt_uint32_t total_trans_cnt_1;
	rt_uint32_t total_trans_cnt_2;
	rt_uint32_t rev_0[4];//0x60 ~ 0x6c
	rt_uint32_t channel_num;
	rt_uint32_t rev_1;
	rt_uint32_t version;
	rt_uint32_t feature;//0x7c
	rt_uint32_t rev_2[992];
	struct dw_mc_dma_chan_regs ch[MC_DMA_MAX_NR_CHANNELS];
	rt_uint32_t rev_3[0x200];
	rt_uint32_t hand_cid[MC_DMA_MAX_HAND_SHAKE_NO];
};

struct dw_mc_dma {
	/* vadd */
	void *regs;
	rt_uint32_t channel_max_number;
	rt_uint32_t controller_status;
	rt_uint32_t id;
    rt_uint32_t irq;
	char name[20];
};

struct dma_channel {
	rt_uint32_t channel_status;  /* open, busy ,closed */
	rt_uint32_t desc_trans_size;
	mc_dma_lock_t channel_lock;
	rt_list_t queue;
	struct dma_transfer *active_trans;
	rt_uint32_t open_flag;
	rt_uint32_t desc_total_no;
	rt_uint32_t free_index;
	rt_uint32_t used_index;
	rt_uint32_t desc_left_cnt;
	/*malloc maybe not allign; driver will malloc (size + cache line) incase*/
	rt_uint32_t allign_malloc;
	unsigned int allign_phy;
	struct mc_dma_lli *base_lli;
	rt_uint32_t base_lli_phy;
	rt_uint32_t isr_enable_mode;
	rt_uint32_t isr_status;
};

struct mc_dma_ops {
	void (*mc_dma_isr_process)(struct fh_dma *param);
